{
    "data": [
        {
            "search": "relapse",
            "summary_word": "relapse",
            "summary": "In internal medicine, relapse or recidivism is a recurrence of a past (typically medical) condition. For example, multiple sclerosis and malaria often exhibit peaks of activity and sometimes very long periods of dormancy, followed by relapse or recrudescence.\nIn psychiatry, relapse or reinstatement of drug-seeking behavior, is a form of spontaneous recovery that involves the recurrence of pathological drug use after a period of abstinence. Relapse is often observed in individuals who have developed a drug addiction or either form of drug dependence.",
            "related_topic": "Math"
        },
        {
            "search": "democratic alliance",
            "summary_word": "democratic alliance",
            "summary": "The National Democratic Alliance (NDA) is an Indian political alliance made up of centre-right  political parties and led by the Bhartiya Janata Party (BJP). It was founded in 1998 and currently controls the Indian union government as well as the government of 18 Indian states.\nIts first chairman was Prime Minister Atal Bihari Vajpayee. L. K. Advani, the former Deputy Prime Minister, took over as chairman in 2004 and served until 2014, and Amit Shah has been the chairman since 2014. The coalition ruled from 1998 to 2004. The alliance returned to power in the 2014 general elections with a combined vote share of 38.5%. Its leader, Modi, was sworn in as Prime Minister of India on 26 May 2014. In the 2019 general election, the alliance further increased its tally to 353 seats with combined vote share of 45.43%.",
            "related_topic": "Math"
        },
        {
            "search": "docket",
            "summary_word": "docket",
            "summary": "Docket may refer to:\n\nDocket (court), the official schedule of proceedings in lawsuits pending in a court of law.\nAgenda (meeting) or docket, a list of meeting activities in the order in which they are to be taken up\nReceipt or tax invoice, a proof of payment for items purchased\nTransport document, e.g. Air Waybill, Bill of Lading or CMR",
            "related_topic": "Math"
        },
        {
            "search": "mab",
            "summary_word": "mab",
            "summary": "A monoclonal antibody (mAb or moAb) is an antibody made by cloning a unique white blood cell.  All subsequent antibodies derived this way trace back to a unique parent cell. \nMonoclonal antibodies can have monovalent affinity, binding only to the same epitope (the part of an antigen that is recognized by the antibody). In contrast, polyclonal antibodies bind to multiple epitopes and are usually made by several different antibody secreting plasma cell lineages. Bispecific monoclonal antibodies can also be engineered, by increasing the therapeutic targets of one single monoclonal antibody to two epitopes.\nIt is possible to produce monoclonal antibodies that specifically bind to virtually any suitable substance; they can then serve to detect or purify it. This capability has become an important tool in biochemistry, molecular biology, and medicine.",
            "related_topic": "Math"
        },
        {
            "search": "covariance",
            "summary_word": "covariance",
            "summary": "In probability theory and statistics, covariance is a measure of the joint variability of two random variables. If the greater values of one variable mainly correspond with the greater values of the other variable, and the same holds for the lesser values (that is, the variables tend to show similar behavior), the covariance is positive. In the opposite case, when the greater values of one variable mainly correspond to the lesser values of the other, (that is, the variables tend to show opposite behavior), the covariance is negative. The sign of the covariance therefore shows the tendency in the linear relationship between the variables. The magnitude of the covariance is not easy to interpret because it is not normalized and hence depends on the magnitudes of the variables. The normalized version of the covariance, the correlation coefficient, however, shows by its magnitude the strength of the linear relation.\nA distinction must be made between (1) the covariance of two random variables, which is a population parameter that can be seen as a property of the joint probability distribution, and (2) the sample covariance, which in addition to serving as a descriptor of the sample, also serves as an estimated value of the population parameter.",
            "related_topic": "Math"
        },
        {
            "search": "thrust",
            "summary_word": "thrust",
            "summary": "Thrust is a reaction force described quantitatively by Newton's third law. When a system expels or accelerates mass in one direction, the accelerated mass will cause a force of equal magnitude but opposite direction, to be applied to that system.\nThe force applied on a surface in a direction perpendicular or normal to the surface is also called thrust. Force, and thus thrust, is measured using the International System of Units (SI) in newtons (symbol: N), and represents the amount needed to accelerate 1 kilogram of mass at the rate of 1 meter per second per second. In mechanical engineering, force orthogonal to the main load (such as in parallel helical gears) is referred to as static thrust.",
            "related_topic": "Math"
        },
        {
            "search": "shakespeare",
            "summary_word": "shakespeare",
            "summary": "William Shakespeare (bapt. 26 April 1564 – 23 April 1616) was an English playwright, poet, and actor, widely regarded as the greatest writer in the English language and the world's greatest dramatist. He is often called England's national poet and the \"Bard of Avon\" (or simply \"the Bard\"). His extant works, including collaborations, consist of some 39 plays, 154 sonnets, three long narrative poems, and a few other verses, some of uncertain authorship. His plays have been translated into every major living language and are performed more often than those of any other playwright. They also continue to be studied and reinterpreted.\nShakespeare was born and raised in Stratford-upon-Avon, Warwickshire. At the age of 18, he married Anne Hathaway, with whom he had three children: Susanna and twins Hamnet and Judith. Sometime between 1585 and 1592, he began a successful career in London as an actor, writer, and part-owner of a playing company called the Lord Chamberlain's Men, later known as the King's Men. At age 49 (around 1613), he appears to have retired to Stratford, where he died three years later. Few records of Shakespeare's private life survive; this has stimulated considerable speculation about such matters as his physical appearance, his sexuality, his religious beliefs, and whether the works attributed to him were written by others.Shakespeare produced most of his known works between 1589 and 1613. His early plays were primarily comedies and histories and are regarded as some of the best work produced in these genres. He then wrote mainly tragedies until 1608, among them Hamlet, Romeo and Juliet, Othello, King Lear, and Macbeth, all considered to be among the finest works in the English language. In the last phase of his life, he wrote tragicomedies (also known as romances) and collaborated with other playwrights.\nMany of Shakespeare's plays were published in editions of varying quality and accuracy in his lifetime. However, in 1623, two fellow actors and friends of Shakespeare's, John Heminges and Henry Condell, published a more definitive text known as the First Folio, a posthumous collected edition of Shakespeare's dramatic works that included all but two of his plays. The volume was prefaced with a poem by Ben Jonson, in which Jonson presciently hailed Shakespeare in a now-famous quote as \"not of an age, but for all time\".",
            "related_topic": "Math"
        },
        {
            "search": "considered",
            "summary_word": "considered",
            "summary": "This is a list of films considered \"the best ever\" in national and international surveys of critics and the public.\nSome surveys focus on all films, while others focus on a particular genre or country. Voting systems differ, and some surveys suffer from biases such as self-selection or skewed demographics, while others may be susceptible to forms of interference such as vote stacking.",
            "related_topic": "Math"
        },
        {
            "search": "canadian rockies",
            "summary_word": "canadian rockies",
            "summary": "The Canadian Rockies (French: Rocheuses canadiennes) or Canadian Rocky Mountains comprise both the Alberta Rockies and the B.C. Rockies in the Canadian segment of the North American Rocky Mountains. They are the eastern part of the North American Cordillera, which is a system of multiple ranges of mountains which runs from the Prairies to the Pacific Coast. The Canadian Rockies mountain system comprises the central/eastern part of this system, lying between the Interior Plains of Alberta and northeastern British Columbia on the east to the Rocky Mountain Trench of BC on the west. The southern end of the Canadian Rockies borders Idaho and Montana of the United States. In geographic terms, the boundary is at the Canada–United States border, but in geological terms it might be considered to be at Marias Pass in northern Montana. The northern end is at the Liard River in northern British Columbia.\nThe Canadian Rockies have numerous high peaks and ranges, such as Mount Robson (3,954 m, 12,972 ft) and Mount Columbia (3,747 m, 12,293 ft). The Canadian Rockies are composed of shale and limestone. Much of the range is protected by national and provincial parks, several of which collectively comprise a World Heritage Site.",
            "related_topic": "Math"
        },
        {
            "search": "personally",
            "summary_word": "personally",
            "summary": "Personally may refer to:\n\n\"Personally\" (P-Square song), 2013\n\"Personally\" (Karla Bonoff song), 1982",
            "related_topic": "Math"
        },
        {
            "search": "confiscate",
            "summary_word": "confiscate",
            "summary": "Confiscation (from the Latin confiscare \"to consign to the fiscus, i.e. transfer to the treasury\") is a legal form of seizure by a government or other public authority. The word is also used, popularly, of spoliation under legal forms, or of any seizure of property as punishment or in enforcement of the law.",
            "related_topic": "Math"
        },
        {
            "search": "core",
            "summary_word": "core",
            "summary": "Core or cores may refer to:",
            "related_topic": "Math"
        },
        {
            "search": "principal value",
            "summary_word": "principal value",
            "summary": "In mathematics, specifically complex analysis, the principal values of a multivalued function are the values along one chosen branch of that function, so that it is single-valued. The simplest case arises in taking the square root of a positive real number. For example, 4 has two square roots: 2 and –2; of these the positive root, 2, is considered the principal root and is denoted as \n  \n    \n      \n        \n          \n            4\n          \n        \n        .\n      \n    \n    {\\displaystyle {\\sqrt {4}}.}",
            "related_topic": "Math"
        },
        {
            "search": "electroconvulsive therapy",
            "summary_word": "electroconvulsive therapy",
            "summary": "Electroconvulsive therapy (ECT), formerly known as electroshock therapy, is a psychiatric treatment in which seizures in the brain (without muscular convulsions) are electrically induced in patients to provide relief from mental disorders. Typically, 70 to 120 volts are applied externally to the patient's head resulting in approximately 800 milliamperes of direct current passed through the brain, for 100 milliseconds to 6 seconds duration, either from temple to temple (bilateral ECT) or from front to back of one side of the head (unilateral ECT).\nThe ECT procedure was first conducted in 1938 by Italian psychiatrist Ugo Cerletti and rapidly replaced less safe and effective forms of biological treatments in use at the time. ECT is often used with informed consent as a safe and effective intervention for major depressive disorder, mania, and catatonia. ECT machines were originally placed in the Class III category by the United States Food and Drug Administration (FDA) in 1976. They were re-classified as Class II devices, for treatment of catatonia, major depressive disorder, and bipolar disorder, in 2018.Aside from effects on the brain, the general physical risks of ECT are similar to those of brief general anesthesia. Immediately following treatment, the most common adverse effects are confusion and transient memory loss. Among treatments for severely depressed pregnant women, ECT is one of the least harmful to the fetus.A usual course of ECT involves multiple administrations, typically given two or three times per week until the patient is no longer suffering symptoms. ECT is administered under anesthesia with a muscle relaxant. ECT can differ in its application in three ways: electrode placement, treatment frequency, and the electrical waveform of the stimulus. These treatment parameters can pose significant differences in both adverse side effects and symptom remission in the treated patient.\nPlacement can be bilateral, where the electric current is passed from one side of the brain to the other, or unilateral, in which the current is solely passed across one hemisphere of the brain. High-dose unilateral ECT has some cognitive advantages compared to moderate-dose bitlateral ECT while showing no difference in antidepressant efficacy.ECT appears to work in the short term via an anticonvulsant effect primarily in the frontal lobes and longer term via neurotrophic effects primarily in the medial temporal lobe.",
            "related_topic": "Math"
        },
        {
            "search": "concerted",
            "summary_word": "concerted",
            "summary": "A concerted reaction is a chemical reaction in which all bond breaking and bond making occurs in a single step. Reactive intermediates or other unstable high energy intermediates are not involved.  Concerted reaction rates tend not to depend on solvent polarity ruling out large buildup of charge in the transition state. The reaction is said to progress through a concerted mechanism as all bonds are formed and broken in concert. Pericyclic reactions, the SN2 reaction, and some rearrangements - such as the Claisen rearrangement - are concerted reactions. \nThe rate of the SN2 reaction is second order overall due to the reaction being bimolecular (i.e. there are two molecular species involved in the rate-determining step). The reaction does not have any intermediate steps, only a transition state. This means that all the bond making and bond breaking takes place in a single step. In order for the reaction to occur both molecules must be situated correctly. \n\n\n== References ==",
            "related_topic": "Math"
        },
        {
            "search": "respect",
            "summary_word": "respect",
            "summary": "Respect, also called esteem, is a positive feeling or action shown towards someone or something considered important, or held in high esteem or regard. It conveys a sense of admiration for good or valuable qualities. And it is also the process of honoring someone by exhibiting care, concern, or consideration for their needs or feelings.Some people may earn the respect of individuals by assisting others or by playing important social roles. In many cultures, individuals are considered to be worthy of respect until they prove otherwise. Courtesies that show respect may include simple words and phrases like \"Thank you\" in the West or \"Namaste\" in the Indian subcontinent, or simple physical signs like a slight bow, a smile, direct eye contact, or a simple handshake; however, those acts may have very different interpretations, depending on the cultural context.",
            "related_topic": "Math"
        },
        {
            "search": "very",
            "summary_word": "very",
            "summary": "Very is an intensifier in the English language. It may also refer to:",
            "related_topic": "Math"
        },
        {
            "search": "reed",
            "summary_word": "reed",
            "summary": "Reed or Reeds may refer to:",
            "related_topic": "Math"
        },
        {
            "search": "divorceless",
            "summary_word": "divorceless",
            "summary": "Randy L. Bott (born 1945) is a former American professor of religion at Brigham Young University (BYU) in Provo, Utah, United States. He taught classes on missionary preparation and the Doctrine and Covenants, and wrote doctrinal and motivational literature about The Church of Jesus Christ of Latter-day Saints (LDS Church). Bott retired from BYU in June 2012 not long after controversy about remarks he made to the media.",
            "related_topic": "Math"
        },
        {
            "search": "ablation",
            "summary_word": "ablation",
            "summary": "Ablation is removal or destruction of material from an object by vaporization, chipping, or other erosive processes. Examples of ablative materials are described below, and include spacecraft material for ascent and atmospheric reentry, ice and snow in glaciology, biological tissues in medicine and passive fire protection materials.",
            "related_topic": "Math"
        }
    ]
}